src/app/controllers/users/registrations_controller.rb

  def update
    super
    current_user.profile_image.attach(params[:user][:profile_image])
    current_user.save
---
UPDATE "users" SET "updated_at" = $1 WHERE "users"."id" = $2  [["updated_at", "2019-11-08 14:39:35.998126"], ["id", 9]]