src/app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE (events.title ILIKE '%ac%' )
---
  def index
    @events = Event.all

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" INNER JOIN "events_users" ON "users"."id" = "events_users"."user_id" WHERE "events_users"."event_id" = $1  [["event_id", 2]]
---
  def join
    event = Event.find(params[:id])
    if event.users.length < event.capacity