src/app/views/pages/index.html.erb

SELECT "events".* FROM "events"
---
<div class="row-goodness">
  <% Event.all.each do |event| %>