src/app/views/events/index.html.erb

SELECT "events".* FROM "events"
---
          <% elsif user_signed_in? %>
          <% if (current_user.owned_events.include?(event)) %>