src/app/views/events/index.html.erb

SELECT "events".* FROM "events"
---
          Going <i class="fas fa-check"></i></p>
          <% elsif (current_user.owned_events.include?(event)) %>