src/app/views/events/show.html.erb

SELECT COUNT(*) FROM "users" INNER JOIN "events_users" ON "users"."id" = "events_users"."user_id" WHERE "events_users"."event_id" = $1  [["event_id", 1]]
---
        <i class="fas fa-users"></i>&nbsp;
        <%= @event.users.count %>  / <%= @event.capacity %> Attending

SELECT  1 AS one FROM "users" INNER JOIN "events_users" ON "users"."id" = "events_users"."user_id" WHERE "events_users"."event_id" = $1 AND "users"."id" = $2 LIMIT $3  [["event_id", 1], ["id", 9], ["LIMIT", 1]]
---

    <% elsif (@event.users.include?(current_user)) %>

SELECT COUNT(*) FROM "users" INNER JOIN "events_users" ON "users"."id" = "events_users"."user_id" WHERE "events_users"."event_id" = $1  [["event_id", 1]]
SELECT COUNT(*) FROM "users" INNER JOIN "events_users" ON "users"."id" = "events_users"."user_id" WHERE "events_users"."event_id" = $1  [["event_id", 2]]
---

    <% elsif (@event.capacity) <= (@event.users.count) %>

        <p class="psmall" style="color:red;"><%= (@event.capacity) - (@event.users.count) %> The Event is Full!</p>