src/app/views/events/your_events.html.erb

SELECT "events".* FROM "events" WHERE "events"."user_id" = $1  [["user_id", 8]]
---

  <% if current_user.owned_events.length == 0 %>

SELECT "events".* FROM "events" WHERE "events"."user_id" = $1  [["user_id", 8]]
---
  <div class="row-goodness">
        <% current_user.owned_events.each do |event| %>

SELECT "events".* FROM "events" INNER JOIN "events_users" ON "events"."id" = "events_users"."event_id" WHERE "events_users"."user_id" = $1  [["user_id", 8]]
---
          Going <i class="fas fa-check"></i></p>
          <% elsif (current_user.owned_events.include?(event)) %>